class Question:
    def __init__(self, id, question, answer):
        self.id = id
        self.question = question
        self.answer = answer

questions_texts = ["Як оформити ВПО?", "Грошова допомога"]
answers_texts = ["Подати заявку можна як онлайн за кілька кліків у застосунку Дія, так і офлайн за місцем проживання у найближчому ЦНАПі чи органах соціального захисту. З 14 років це можна робити самостійно, від імені дитини мають подавати заявку батьки. Якщо людина є недієздатною або має обмежену дієздатність — від її імені документи подає законний представник. ",
           "Допомогу можуть отримати люди, які змушені були покинути домівки та переїхати до більш безпечних громад на території України. Щомісяця це 2000 грн для кожного дорослого та 3000 грн для дітей і людей з інвалідністю. Кошти перераховують на картку єПідтримка, а витрачати їх можна без обмежень — розраховуватися за товари й послуги, знімати готівку або ж допомагати ЗСУ."
           ]

questions_list = {i: Question(i, q, a) for i, (q, a) in enumerate(zip(questions_texts, answers_texts))}


def get_question_by_id(id):
    return questions_list.get(id)